QuinnRuth/embedded/stm32/learning/lesson_6-8/src/Encoder.c
/**
 * @file    Encoder.c
 * @brief   Encoder Interface using TIM3
 * @note    Uses TIM3 encoder mode on PA6 (CH1) and PA7 (CH2)
 *
 * Encoder Resolution:
 *   - Typical: 100-1000 pulses per revolution
 *   - Each pulse = 2 counts (rising + falling on both phases)
 */

#include "stm32f10x.h"
#include "Encoder.h"

int16_t Encoder_Count = 0;

/**
 * @brief  Initialize encoder interface on TIM3
 */
void Encoder_Init(void)
{
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
    TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_TimeBaseInitStructure.TIM_Period = 65535;
    TIM_TimeBaseInitStructure.TIM_Prescaler = 1;
    TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseInitStructure);

    TIM_EncoderInterfaceConfig(TIM3, TIM_EncoderMode_TI12,
                               TIM_ICPolarity_Rising,
                               TIM_ICPolarity_Rising);

    TIM_Cmd(TIM3, ENABLE);
}

/**
 * @brief  Get encoder count change since last call
 * @return Count difference (positive = CW, negative = CCW)
 */
int16_t Encoder_Get(void)
{
    int16_t Temp = Encoder_Count;
    Encoder_Count = 0;
    return Temp;
}
